export interface Question {
  id: number;
  text: string;
  options: string[];
  correctAnswerIndex: number;
}

export const QUESTIONS: Question[] = [
  {
    "id": 1,
    "text": "1930  ലെ ആദ്യ ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ എത്ര ടീമുകള്‍ പങ്കെടുത്തു?",
    "options": [
      "10",
      "15",
      "13"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 2,
    "text": "1930  ആദ്യ ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ കിരീടം നേടിയ രാജ്യം?",
    "options": [
      "ഉറുഗ്വേ",
      "ബ്രസീല്‍",
      "യുഗോസ്ലാവിയ"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 3,
    "text": "ലോകകപ്പ് ഫുട്‌ബോളിന്റെ ചരിത്രത്തില്‍ ഇതുവരെ നടന്ന എല്ലാ ചാംപ്യന്‍ഷിപ്പുകളിലും പങ്കെടുത്ത ടീം?",
    "options": [
      "പോര്‍ച്ചുഗല്‍",
      "ബ്രസീല്‍",
      "അര്‍ജന്റീന"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 4,
    "text": "ഖത്തറിന് മുന്‍പ് ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പിന് വേദിയൊരുക്കിയ ഏഷ്യന്‍ രാജ്യം?",
    "options": [
      "ഇറാന്‍",
      "ജപ്പാന്‍",
      "ദക്ഷിണ കൊറിയ - ജപ്പാന്‍ സംയുക്തമായി"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 5,
    "text": "ഇതുവരെ എത്ര രാജ്യങ്ങള്‍ ലോകകപ്പ് ഫുട്‌ബോള്‍ കിരീടം നേടിയിട്ടുണ്ട്?",
    "options": [
      "10",
      "8",
      "12"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 6,
    "text": "രാജ്യാന്തര ഫുട്‌ബോള്‍ മത്സരങ്ങള്‍ നിയ്രന്തിക്കുന്ന സംഘടനയായ ഫിഫ (FIFA) \t\tരൂപീകരിക്കപ്പെട്ടത് എന്ന്?",
    "options": [
      "1904 മെയ് 21",
      "1921 ജൂണ്‍ 10",
      "1910 നവംബര്‍ 1"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 7,
    "text": "FIFA പ്രസിഡന്റായി ഏറ്റവുമധികം കാലം സേവനമനുഷ്ഠിച്ച വ്യക്തി ആര്?",
    "options": [
      "ജൂള്‍ റിമേ",
      "ജിയാനി ഇന്‍ഫന്റിനോ",
      "മിഷേല്‍ പ്ലാറ്റിനി"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 8,
    "text": "FIFA സംഘടിപ്പിച്ച ആദ്യ വനിതാ ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പ് ഏതു വര്‍ഷമാണ് അരങ്ങേറിയത്?",
    "options": [
      "1975",
      "2001",
      "1991"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 9,
    "text": "FIFA ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ വിജയികള്‍ക്ക് സമ്മാനിക്കുന്ന ട്രോഫിക്ക് 1970 വരെ ഉണ്ടായിരുന്ന പേരെന്ത്?",
    "options": [
      "ജൂള്‍ റിമേ ട്രോഫി",
      "ഫിഫ ട്രോഫി",
      "പെലെ ട്രോഫി"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 10,
    "text": "FIFA ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ വിജയികള്‍ക്ക് ഇപ്പോള്‍ സമ്മാനിക്കുന്ന ട്രോഫി രൂപകല്‍പന ചെയ്തതാര്?",
    "options": [
      "മൈക്കെലാഞ്ജലോ",
      "ദാലി",
      "സില്‍വിയോ ഗസ്സാനിഗ"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 11,
    "text": "FIFA യുടെ ആസ്ഥാനം എവിടെ?",
    "options": [
      "റിയോ ഡി ജനീറോ",
      "സൂറിച്ച്",
      "ബര്‍ലിന്‍"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 12,
    "text": "ആദ്യമായി ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പിന് ആതിഥ്യമരുളിയ ആഫ്രിക്കന്‍ രാജ്യം?",
    "options": [
      "ഘാന",
      "നൈജീരിയ",
      "ദക്ഷിണാഫ്രിക്ക"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 13,
    "text": "ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പിന്റെ സെമിഫൈനല്‍ വരെയെത്തിയ ഒരേയൊരു ഏഷ്യന്‍ രാജ്യം?",
    "options": [
      "സൗദി അറേബ്യ",
      "ജപ്പാന്‍",
      "ദക്ഷിണ കൊറിയ"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 14,
    "text": "ലോകകപ്പിലെ മികച്ച കളിക്കാരനുള്ള ഗോള്‍ഡന്‍ ബോള്‍ ആദ്യമായി ഏര്‍പ്പെടുത്തിയത് 1982ല്‍ സ്‌പെയിനില്‍ വച്ചു നടന്ന ചാംപ്യന്‍ഷിപ്പിലാണ്. ആരാണ് അത് നേടിയത്?",
    "options": [
      "പൗളോ റോസി",
      "മറഡോണ",
      "ഫല്‍കാവോ"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 15,
    "text": "ഏറ്റവുമധികം തവണ ഫിഫ ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പി‍ന് വേദിയൊരുക്കിയ രാജ്യം‍?",
    "options": [
      "ബ്രസീല്‍",
      "ഫ്രാന്‍സ്",
      "മെക്സിക്കോ"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 16,
    "text": "ഫുട്‌ബോള്‍ ലോകകപ്പില്‍ ഒരു ചാംപ്യന്‍ഷിപ്പില്‍ ഏറ്റവുമധികം ഗോളുകള്‍ നേടിയ കളിക്കാരന്‍?",
    "options": [
      "മിറോസ്ലാവ് ക്ലോസെ",
      "മറഡോണ",
      "ജസ്റ്റ് ഫൊണ്ടെയ്ന്‍"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 17,
    "text": "മൂന്ന് ലോകകപ്പ് വിജയങ്ങളില്‍ പങ്കാളിയായ ലോകത്തിലെ ഒരേയൊരു കളിക്കാരന്‍?",
    "options": [
      "മുള്ളര്‍",
      "പെലെ",
      "സിദാന്‍"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 18,
    "text": "രണ്ട് ലോകകപ്പ് വിജയങ്ങളില്‍ പങ്കാളിയായ ഒരേയൊരു കോച്ച്?",
    "options": [
      "വിറ്റോറിയോ പോസ്സോ",
      "ഫ്രാന്‍സ് ബെക്കന്‍ബോവര്‍",
      "മരിയോ സഗാലോ"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 19,
    "text": "ലോകകപ്പ് ഫുട്‌ബോളില്‍ ഏറ്റവും അധികം തവണ ഫൈനല്‍ കളിച്ച ടീം ഏത്?",
    "options": [
      "ജര്‍മനി",
      "ഫ്രാന്‍സ്",
      "ബ്രസീൽ"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 20,
    "text": "ദൈവത്തിന്റെ കൈ' എന്ന പേരില്‍ കുപ്രസിദ്ധിയാര്‍ജിച്ച ഗോള്‍ നേടിയതാര്?",
    "options": [
      "ഗബ്രിയേല്‍ ബാറ്റിസ്റ്റ്യൂട്ട",
      "ഗ്രീസ്മാന്‍",
      "മറഡോണ"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 21,
    "text": "ലോകകപ്പ് ഫുട്‌ബോള്‍ കിരീടം കരസ്ഥമാക്കിയ ടീമിലംഗമായ ഏറ്റവും പ്രായം കുറഞ്ഞ കളിക്കാരന്‍?",
    "options": [
      "ലൂയി ഫിഗോ",
      "പെലെ",
      "ഗാരി ലിനേക്കര്"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 22,
    "text": "ലോകകപ്പ് കളിച്ച ഏറ്റവും പ്രായം കൂടിയ കളിക്കാരന്‍?",
    "options": [
      "എസ്സാം എല്‍ ഹാദരി",
      "സ്‌കില്ലാച്ചി",
      "മത്തേയൂസ്"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 23,
    "text": "ഗോള്‍ ഓഫ് ദി സെഞ്ച്വറി' (The Goal of the Century) എന്ന് കീര്‍ത്തികേട്ട ഗോള്‍ മറഡോണ നേടിയത് ഏത് ലോകകപ്പില്‍?",
    "options": [
      "1990",
      "1986",
      "1994"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 24,
    "text": "വനിതകള്‍ക്കായുള്ള ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പ് ഏറ്റവുമധികം തവണ നേടിയ രാജ്യം?",
    "options": [
      "യുഎസ്എ",
      "ജപ്പാന്‍",
      "ബ്രസീല്‍"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 25,
    "text": "വനിതകള്‍ക്കായുള്ള ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പ് നേടിയ ഏഷ്യന്‍ രാജ്യം?",
    "options": [
      "ചൈന",
      "ദക്ഷിണ കൊറിയ",
      "ജപ്പാന്‍"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 26,
    "text": "ഏറ്റവുമധികം ലോകകപ്പ് ചാംപ്യന്‍ഷിപ്പുകളില്‍ കളിച്ച താരം?",
    "options": [
      "അന്റോണിയോ കര്‍ബജാല്‍",
      "ഫോര്‍മിഗ",
      "ലോതര്‍ മത്തേയൂസ്"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 27,
    "text": "2017ലെ അണ്ടര്‍ - 17 ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പ് അരങ്ങേറിയ രാജ്യം?",
    "options": [
      "നൈജീരിയ",
      "ഇന്ത്യ",
      "ബ്രിട്ടന്‍"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 28,
    "text": "Scorpion kick എന്ന പേരില്‍ പ്രശസ്തമായ കിക്ക് ആവിഷ്‌ക്കരിച്ചത് 1990 ലോകകപ്പില്‍ കളിച്ച ഒരു ഗോള്‍കീപ്പറാണ്. ആരാണിദ്ദേഹം?",
    "options": [
      "റെനെ ഹിഗ്വിറ്റ",
      "ലെവ് യാഷിന്‍",
      "മാനുവല്‍ ന്യൂയര്"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 29,
    "text": "ഫിഫ അണ്ടര്‍ - 17 വനിതാ ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പിന് 2022ല്‍ വേദിയായ ഏഷ്യന്‍ രാജ്യം?",
    "options": [
      "ഇന്ത്യ",
      "തായ്‌ലന്‍ഡ്",
      "ഇന്തോനേഷ്യ"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 30,
    "text": "ഫിഫ അണ്ടര്‍ - 20 ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പ് എത്ര വര്‍ഷം കൂടുമ്പോഴാണ് സംഘടിപ്പിക്കപ്പെടുന്നത്?",
    "options": [
      "4 വര്‍ഷം",
      "2 വര്‍ഷം",
      "5 വര്‍ഷം"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 31,
    "text": "ഫിഫ റാങ്കിങ് പ്രകാരം ഇപ്പോഴത്തെ ലോക ഒന്നാം നമ്പര്‍ ഫുട്‌ബോള്‍ ടീം എത്?",
    "options": [
      "ബ്രസീല്‍",
      "ഫ്രാന്‍സ്",
      "സ്‌പെയ്ന്‍"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 32,
    "text": "ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പിലെ ഏറ്റവും വേഗതയേറിയ ഗോള്‍ നേടിയതാര്?",
    "options": [
      "വാക്ലാവ് മാസെക്",
      "ബ്രയാന്‍ റോബ്‌സണ്‍",
      "ഹാകാന്‍ സൂകര്‍"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 33,
    "text": "2022 ഖത്തര്‍ ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ എത്ര ടീമുകള്‍ പങ്കെടുക്കുത്തു?",
    "options": [
      "28",
      "32",
      "40"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 34,
    "text": "2022 ഖത്തര്‍ ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പിന്റെ ഭാഗ്യചിഹ്നം ഏതായിരുന്നു?",
    "options": [
      "ലയീബ് (La'eeb)",
      "സാബിവാക (Zabivaka)",
      "സാകുമി (Zakumi)"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 35,
    "text": "ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ ഭാഗ്യചിഹ്നം അവതരിപ്പിച്ചു തുടങ്ങിയതെന്ന്?",
    "options": [
      "2002",
      "1974",
      "1966"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 36,
    "text": "2026 ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ എത്ര ടീമുകള്‍ക്കാണ് പ്രവേശനം?",
    "options": [
      "48",
      "32",
      "40"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 37,
    "text": "2022 ഖത്തര്‍ ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ ഉപയോഗിച്ച ഔദ്യോഗിക പന്ത് അല്‍ റിഹ്‌ല (Al Rihla) നിര്‍മിച്ചത് ഏതു കമ്പനി?",
    "options": [
      "നൈക്കി",
      "അഡിഡാസ്",
      "ലീനിങ്"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 38,
    "text": "അമേരിക്ക-മെക്സികോ-കാനഡ എന്നീ രാജ്യങ്ങള്‍ സംയുക്തമായി ആതിഥേയത്വം വഹിക്കുന്ന 2026 ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പില്‍ പങ്കെടുക്കുന്ന ഏറ്റവും ചെറിയ രാജ്യം ഏത്?",
    "options": [
      "ഹെയ്തി (Haiti)",
      "കൂറസാവോ (Curaçao)",
      "കേപ് വെര്‍ദെ (Cape Verde)"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 39,
    "text": "ലോകകപ്പ് ഫുട്‌ബോളില്‍ ഒരൊറ്റ മത്സരത്തില്‍ ഏറ്റവും കൂടുതല്‍ \tഗോളുകള്‍ നേടിയ താരമാര്?",
    "options": [
      "ക്രിസ്റ്റ്യാനോ റൊണാള്‍ഡോ",
      "മിറോസ്ലാവ് ക്ലോസെ",
      "ഒലെഗ് സാലെങ്കോ"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 40,
    "text": "ഫുട്‌ബോള്‍ ലോകകപ്പ് ചരിത്രത്തിലെ ആദ്യ ഹാട്രിക്ക് (hat-trick) നേടിയതാര്?",
    "options": [
      "ഗേര്‍ഡ് മുള്ളര്‍",
      "ബെര്‍ട് പാറ്റ്നോഡ്",
      "ജസ്റ്റ് ഫൊണ്ടെയ്ന്‍"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 41,
    "text": "രണ്ട് ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പുകളില്‍ ഹാട്രിക്ക് നേടിയ ഏക കളിക്കാരന്‍?",
    "options": [
      "ഒലെഗ് സാലെങ്കോ‍",
      "പെലെ",
      "ഗബ്രിയേല്‍  ബാറ്റിസ്റ്റ‍്യൂട്ട"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 42,
    "text": "ഫുട്‌ബോൾ ലോകകപ്പിന്റെ ചരിത്രത്തിൽ കോർണർ കിക്കിൽ നിന്ന് നേരിട്ട് ഗോൾ (Olympic Goal) നേടിയ ഒരേയൊരു കളിക്കാരൻ?",
    "options": [
      "മാർക്കോസ് കോൾ",
      "മെസി",
      "ഗബ്രിയേല്‍  ബാറ്റിസ്റ്റ‍്യൂട്ട"
    ],
    "correctAnswerIndex": 0
  },
  {
    "id": 43,
    "text": "ലോകകപ്പ് ഫുട്‌ബോള്‍ ചാംപ്യന്‍ഷിപ്പു കളില്‍ ഗോള്‍ നേടിയിട്ടുള്ള ഏറ്റവും പ്രായം കൂടിയ കളിക്കാരന്‍?",
    "options": [
      "പെപെ",
      "റോജര്‍ മില്ല",
      "മാര്‍ട്ടിന്‍ പാലെര്‍മോ"
    ],
    "correctAnswerIndex": 1
  },
  {
    "id": 44,
    "text": "ലോകകപ്പ് ഫുട്‌ബോള്‍ ചരിത്രത്തിൽ‍ ഗോള്‍ നേടിയിട്ടുള്ള ഏറ്റവും പ്രായം കുറഞ്ഞ കളിക്കാരന്‍?",
    "options": [
      "ഗാവി",
      "മൈക്കല്‍ ഓവന്‍",
      "പെലെ"
    ],
    "correctAnswerIndex": 2
  },
  {
    "id": 45,
    "text": "ലോകകപ്പ് ഫുട്‌ബോള്‍ ചരിത്രത്തിലെ ആദ്യ ഗോള്‍ നേടിയ കളിക്കാരന്‍?",
    "options": [
      "ലൂസിയൻ ലോറന്റ്",
      "മൈക്കല്‍ ഓവന്‍",
      "പെലെ"
    ],
    "correctAnswerIndex": 0
  }
];
